name: "tokenizer"
backend: "python"
max_batch_size: 64

input [
  {
    name: "TEXT_INPUT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "INPUT_IDS"
    data_type: TYPE_INT32
    dims: [ 77 ]
  },
  {
    name: "ATTN_MASK"
    data_type: TYPE_INT32
    dims: [ 77 ]
  }
]

instance_group [
  {
    count: 2  # Run two instances on CPU for higher throughput
    kind: KIND_CPU
  }
]